/*----------------------------辅助函数----------------------------*/



/*---------------------------------------------------------------*/
/*                       升序函数（stdlib.h)                       */
/*---------------------------------------------------------------*/
int compare (const void * a, const void * b){
    return  *(float *)a >= *(float *)b ? 1 : -1;
}

/*---------------------------------------------------------------*/
/*                            升序函数-选择排序                            */
/*---------------------------------------------------------------*/

/*void sort(float *a, int l)                       //a为数组地址，l为数组长度。
{
    int i, j;
    float v;
    //排序主体
    for(i = 0; i < l - 1; i ++)
        for(j = i+1; j < l; j ++)
        {
            if(a[i] > a[j])                      //如前面的比后面的大，则交换。
            {
                v = a[i];
                a[i] = a[j];
                a[j] = v;
            }
        }
}*/


/*---------------------------------------------------------------*/
/*                        升序函数-Shell排序                       */
/*---------------------------------------------------------------*/

void sort(float * data, int n) {
    int step,i,j;
    float key;
    //将数组按照step分组，不断二分到每组只剩下一个元素
    for(step=n/2;step>0;step/=2) {
        //将每组中的元素排序，小的在前
        for(i=step;i<n;i++) {
            key = data[i];
            for(j=i-step;j>=0 && key<data[j];j-=step) {
                data[j+step] = data[j];
            }
            //和上面的for循环一起，将组中小的元素换到数组的前面
            data[j+step] = key;
        }
    }
}


/*---------------------------------------------------------------*/
/*                          相对速度值函数                         */
/*---------------------------------------------------------------*/
float ABS(float a){
    return (a<0) ? a*(-1) : 2;              //注意此处，相对速度大于零时，返回的是1
}

/*---------------------------------------------------------------*/
/*                         数组平均值函数                           */
/*---------------------------------------------------------------*/
//求一个数组从n项到m项的平均值(包含n项，m项）
float mean_array(float * p, int n, int m) {
    float total = 0.0;
    int i = n;
    while (i < m+1) {
        total += *(p + i);
        //printf("%.1f  \n", total);   //测试行
        i += 1;
    }
    return total / (m-n+1);
}

/*---------------------------------------------------------------*/
/*                     取输出较大值函数(float)                      */
/*---------------------------------------------------------------*/

float MAX(float a, float b){
    return (a>b) ? a : b;
}

/*---------------------------------------------------------------*/
/*                     取输出较大值函数(int)                        */
/*---------------------------------------------------------------*/

int MAX_int(int a, int b){
    return (a>b) ? a : b;
}
